{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "amusement park",
    "1": "beach",
    "2": "cave",
    "3": "island",
    "4": "lake",
    "5": "mountain",
    "6": "palace",
    "7": "park",
    "8": "tower"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "amusement park": 0,
    "beach": 1,
    "cave": 2,
    "island": 3,
    "lake": 4,
    "mountain": 5,
    "palace": 6,
    "park": 7,
    "tower": 8
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.33.2"
}
